<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"eb617dfd66bb979a1a77aca694baeb5ed895c9735e4726f58f8ffc9633880d29","plan_job_ref":"Job PR Plan #14 at https://github.com/cabinetoffice/gpa-rosy-iac/actions/runs/13921195841","plan_out_hash":"f4b1ec10a468ea47fb68e12283c60a88303d244bdca154751c8fa1e453280270","plan_hash":"cedda50060d1acb7d6ba4b6df72d8a6059af8ecaef379c74385d36089e0ef17d","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 9 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_emr_cluster.emr_cluster will be created
+   resource "aws_emr_cluster" "emr_cluster" {
+       applications                      = [
+           "Hadoop",
+           "Hive",
        ]
+       arn                               = (known after apply)
+       cluster_state                     = (known after apply)
+       configurations_json               = jsonencode(
            [
+               {
+                   Classification = "spark"
+                   Properties     = {
+                       maximizeResourceAllocation = "true"
                    }
                },
            ]
        )
+       id                                = (known after apply)
+       keep_job_flow_alive_when_no_steps = (known after apply)
+       log_uri                           = "s3://aws-logs-650066862270-eu-west-2/elasticmapreduce/logs/"
+       master_public_dns                 = (known after apply)
+       name                              = "ioblend_cluster"
+       release_label                     = "emr-6.10.0"
+       scale_down_behavior               = (known after apply)
+       service_role                      = "ioblend_emr_cluster_role"
+       step                              = (known after apply)
+       step_concurrency_level            = 1
+       tags                              = {
+           "Environment" = "dev"
+           "Project"     = "datahub-ioblend-emr"
        }
+       tags_all                          = {
+           "Env"         = "dev"
+           "Environment" = "dev"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "datahub-ioblend-emr"
        }
+       termination_protection            = (known after apply)
+       visible_to_all_users              = true

+       bootstrap_action {
+           name = "Install libraries"
+           path = "s3://generic-ioblend-emr-boostrap/bootstrap/ioblend_bootstrap.sh"
        }

+       core_instance_fleet (known after apply)

+       core_instance_group {
+           id             = (known after apply)
+           instance_count = 2
+           instance_type  = "m5.xlarge"

+           ebs_config (known after apply)
        }

+       ec2_attributes {
+           emr_managed_master_security_group = "sg-0d0e55abe696b99c1"
+           emr_managed_slave_security_group  = "sg-036a1b25dea994f49"
+           instance_profile                  = "ioblend_emr_ec2_instance_profile"
+           key_name                          = "ec2-key-pair"
+           service_access_security_group     = (known after apply)
+           subnet_id                         = "************************"
+           subnet_ids                        = (known after apply)
        }

+       master_instance_fleet (known after apply)

+       master_instance_group {
+           id             = (known after apply)
+           instance_count = 1
+           instance_type  = "m5.xlarge"

+           ebs_config (known after apply)
        }
    }

  # aws_iam_instance_profile.emr_instance_profile will be created
+   resource "aws_iam_instance_profile" "emr_instance_profile" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = "ioblend_emr_ec2_instance_profile"
+       name_prefix = (known after apply)
+       path        = "/"
+       role        = "ioblend_emr_ec2_role"
+       tags_all    = {
+           "Env"       = "dev"
+           "ManagedBy" = "Terraform"
+           "Project"   = "gpa-datahub-ioblend-emr-dev"
        }
+       unique_id   = (known after apply)
    }

  # aws_iam_policy.generic_ioblend_emr_boostrap_policy will be created
+   resource "aws_iam_policy" "generic_ioblend_emr_boostrap_policy" {
+       arn         = (known after apply)
+       description = "Policy to allow S3 bucket access"
+       id          = (known after apply)
+       name        = "emrS3AccessPolicy"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:GetObject",
+                           "s3:PutObject",
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::generic-ioblend-emr-boostrap",
+                           "arn:aws:s3:::generic-ioblend-emr-boostrap/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = {
+           "Env"       = "dev"
+           "ManagedBy" = "Terraform"
+           "Project"   = "gpa-datahub-ioblend-emr-dev"
        }
    }

  # aws_iam_role.emr_ec2_instance_role will be created
+   resource "aws_iam_role" "emr_ec2_instance_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "ioblend_emr_ec2_role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Env"       = "dev"
+           "ManagedBy" = "Terraform"
+           "Project"   = "gpa-datahub-ioblend-emr-dev"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role.emr_service_role will be created
+   resource "aws_iam_role" "emr_service_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "elasticmapreduce.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "ioblend_emr_cluster_role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Env"       = "dev"
+           "ManagedBy" = "Terraform"
+           "Project"   = "gpa-datahub-ioblend-emr-dev"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role.ioblend_emr_role will be created
+   resource "aws_iam_role" "ioblend_emr_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "ioblend-emr-s3-access-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Env"       = "dev"
+           "ManagedBy" = "Terraform"
+           "Project"   = "gpa-datahub-ioblend-emr-dev"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_policy will be created
+   resource "aws_iam_role_policy_attachment" "attach_policy" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "ioblend-emr-s3-access-role"
    }

  # aws_iam_role_policy_attachment.emr_ec2_policy will be created
+   resource "aws_iam_role_policy_attachment" "emr_ec2_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonElasticMapReduceforEC2Role"
+       role       = "ioblend_emr_ec2_role"
    }

  # aws_iam_role_policy_attachment.emr_service_policy will be created
+   resource "aws_iam_role_policy_attachment" "emr_service_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonElasticMapReduceRole"
+       role       = "ioblend_emr_cluster_role"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   emr_cluster_id = (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "aws_account_id" but a
value was found in file "env_vars/variables_dev.tfvars". If you meant to use
this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "role_to_assume_arn" but a
value was found in file "env_vars/variables_dev.tfvars". If you meant to use
this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.
```
</details>

:memo: Plan generated in [PR Plan #14](https://github.com/cabinetoffice/gpa-rosy-iac/actions/runs/13921195841)